In [ ]:
#### -*- coding:utf-8 -*-
# 2 Pandas
from pandas import Series, DataFrame  # Series å’Œ DataFrameä½¿ç”¨æ¬¡æ•°å¾ˆå¤šï¼Œæ•…ç›´æ¥å¼•å…¥æœ¬åœ°å‘½åç©ºé—´
import pandas as pd

In [4]:
# Series
# ç±»ä¼¼ä¸€ç»´æ•°ç»„ï¼Œç”±ä¸€ç»„æ•°æ®ä¸ä¸€ç»„ä¸ä¹‹ç›¸å…³çš„æ•°æ®æ ‡ç­¾ç»„æˆ
obj = Series([4, 7, -5, 3]) # å·¦ä¸ºç´¢å¼•ï¼Œå³ä¸ºå€¼ï¼Œ ç´¢å¼•é»˜è®¤ä¸º0åˆ°N-1
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values  # è·å–å€¼

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index  # è·å–ç´¢å¼•

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = Series([4, 7, -5, 3], index = ['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
# é€šè¿‡ç´¢å¼•æå–
obj2['a']

-5

In [9]:
# é€šè¿‡åˆ—è¡¨ç´¢å–
obj2[['c', 'a', 'd']]

c    3
a   -5
d    4
dtype: int64

In [12]:
# å› ä¸ºSeriesæ˜¯ç´¢å¼•å€¼åˆ°æ•°æ®å€¼çš„ä¸€ä¸ªæ˜ å°„ï¼Œçœ‹ä½œä¸€ä¸ªå®šé•¿çš„æœ‰åºå­—å…¸ï¼Œæ•…å¯ä»¥ç›´æ¥ä¼ å…¥å­—å…¸åˆ›å»ºSeries
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [14]:
states = ['California', 'Ohio', 'Oregon', 'Texas']  # å…¶ä¸­é‚£ä¸ªCaliforniaæ— æ³•åŒ¹é…ï¼Œæ‰€ä»¥å¡«çš„æ˜¯NaN
obj4 = Series(sdata, index = states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [15]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [16]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [17]:
obj4.isnull()  # ç›¸åŒçš„æ–¹æ³•

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [19]:
obj3+obj4  # è‡ªåŠ¨å¯¹é½ï¼Œ6ä¸6

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [20]:
obj4.name = 'population'  # Seriesæœ‰nameå±æ€§
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [21]:
obj.index = ['Bob', 'steve', 'Jeff', 'Ryan']  # ç´¢å¼•å¯ä»¥é€šè¿‡èµ‹å€¼æ¥ä¿®æ”¹
obj

Bob      4
steve    7
Jeff    -5
Ryan     3
dtype: int64

In [22]:
# DataFrame
# 1.å¯ä»¥ç›´æ¥ä¼ å…¥å­—å…¸
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],
       'year':[2000,2001,2002,2001,2002],
       'pop':[1.5,1.7,3.6,2.4,2.9]}
frame = DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [39]:
frame2 = DataFrame(data, columns =['year','state','pop'], index = ['one','two','three','four','five'])  # å¯ä»¥è§„å®šåˆ—åé¡ºåº,è¡Œå
frame2

       year   state  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9

In [35]:
# ä»DataFrameä¸­æå–Series
frame['state']  # å­—å…¸é£æ ¼æå–

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
Name: state, dtype: object

In [37]:
frame.state  # å±æ€§ç‚¹ç¼€é£æ ¼æå–

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
Name: state, dtype: object

In [40]:
# ä»DataFrameé‡Œæå–è¡Œ
frame2.ix['three']  # bad behaviour

d:\software\pythonide\envs\oda\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

year     2002
state    Ohio
pop       3.6
Name: three, dtype: object

In [43]:
frame2.loc['three']  # preference

year     2002
state    Ohio
pop       3.6
Name: three, dtype: object

In [45]:
# æ·»åŠ åˆ—
frame2['debt'] = 16.5  #  å¦‚æœæ˜¯Seriesä¼šåŒ¹é…ç´¢å¼•
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [48]:
# åˆ é™¤åˆ—
frame2['eastern'] = frame2.state == 'Ohio'
del frame2['eastern']

In [49]:
# 2.é€šè¿‡åµŒå¥—ç´¢å¼•   
pop = {'Nevada':{2001:2.4,2002:2.9},             # å¤–å±‚å­—å…¸çš„é”®ä¸ºåˆ—ï¼Œå†…å±‚å­—å…¸çš„é”®ä¸ºè¡Œç´¢å¼•
      'Ohio':{2000:1.5,2001:1.7,2002:3.6}}
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [50]:
frame3.T  # å¯ä»¥è½¬ç½®å“¦

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [52]:
# ä¹Ÿå¯ä»¥ç”¨Seriesç»„æˆå­—å…¸ä¼ å…¥
pdata = {'Ohio':frame3['Ohio'][:-1],
        'Nevada':frame3['Nevada'][:2]}
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [59]:
# è®¾ç½®DataFrameçš„name
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [61]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [63]:
# ç´¢å¼•å¯¹è±¡
obj = Series(range(3), index = ['a','b','c'])
index = obj.index
index  # indexä¸å¯ä¿®æ”¹

Index(['a', 'b', 'c'], dtype='object')

In [ ]:
# ç´¢å¼•çš„å‡½æ•°
# append è¿æ¥ä¸¤ä¸ªç´¢å¼•å¯¹è±¡
# diff , intersection, union, isin
# delelte, drop åˆ é™¤ç´¢å¼•iå¤„å…ƒç´ ï¼Œå¹¶å¾—åˆ°æ–°index, åˆ é™¤ä¼ å…¥å€¼ï¼Œå¹¶å¾—åˆ°æ–°çš„index
# insert æ’å…¥å¾—åˆ°æ–°index
# is_monotonic, is_unique, unique

In [64]:
# åŸºæœ¬åŠŸèƒ½
#1 é‡æ–°ç´¢å¼•
obj = Series([4.5, 7.2, -5.3, 3.6], index = ['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [65]:
obj.reindex(['a','b','c','d','e'], fill_value = 0) # fill_value æ˜¯æ’å€¼å¤„ç†
                                                   # method = ffill(pad)å‰å‘å¡«å……ï¼Œbfill(backfill)åå‘å¡«å……
                                                   # ä»…æœ‰ä¸€ä¸ªåºåˆ—å°±æ˜¯é»˜è®¤é‡æ–°è¡Œç´¢å¼•ï¼ˆindex=...ï¼‰ï¼ŒæŒ‡å®šåˆ—ç´¢å¼•éœ€è¦columns = ...,
                                                   # å¹¶ç”¨ä¸‹æ’å€¼åªç”¨äºè¡Œ

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [68]:
# åˆ©ç”¨ixçš„æ ‡ç­¾åŠŸèƒ½ï¼Œé‡æ–°ç´¢å¼•ä»»åŠ¡å¯ä»¥å˜å¾—æ›´åŠ ç®€æ´#############################################################################ğŸ®
frame.ix[['a','b','c','d'],['Texas','Utah','California']]  # æ˜¾ç¤ºè¡Œç´¢å¼•ï¼Œåæ˜¯åˆ—ç´¢å¼•,å¡«æ•´æ•°ä¹Ÿå¯ä»¥çš„
                                                           # ix = loc + iloc

   Texas  Utah  California
a    NaN   NaN         NaN
b    NaN   NaN         NaN
c    NaN   NaN         NaN
d    NaN   NaN         NaN

In [71]:
#2 ä¸¢å¼ƒåˆ¶å®šè½´ä¸Šçš„é¡¹
obj.drop(['d','c'])

b    7.2
a   -5.3
dtype: float64

In [75]:
frame3.drop([2001,2002])  #  DataFrameå¯ä»¥åˆ é™¤ä»»æ„è½´

state  Nevada  Ohio
year
2000      NaN   1.5

In [88]:
#3 ç´¢å¼•çš„é€‰å–ä¸è¿‡æ»¤
# æ ‡ç­¾ç´¢å¼•æ˜¯æœ«ç«¯åŒ…å«çš„
obj['b':'a']

b    7.2
a   -5.3
dtype: float64

In [93]:
# å¯¹DataFrameç´¢å¼•åªæ˜¯è·å–åˆ—
# æƒ³è·å–è¡Œï¼Œè¿˜å¾—ix
frame3.loc[2000]

state
Nevada    NaN
Ohio      1.5
Name: 2000, dtype: float64

In [95]:
frame3.loc[2000, 'Ohio']  # å…ˆæå–è¡Œå†æå–åˆ—

1.5

In [98]:
# icol,irow --æ ¹æ®æ•´æ•°ä½ç½®æå–åˆ—/è¡Œ
# get_value -- æ ¹æ®è¡Œæ ‡ç­¾å’Œåˆ—æ ‡ç­¾æå–å•ä¸ªå€¼
frame3.get_value(2000,'Ohio')

1.5

In [110]:
#4 ç®—æœ¯è¿ç®—ä¸æ•°æ®å¯¹é½
# å¡«å…… fill_value = 
# çœ‹çœ‹broadcastingçš„åŠ›é‡ 
frame = DataFrame(np.arange(12).reshape((4,3)),columns = list('bde'),index = ['Utah','Ohio','Texas','Oregon'])
series = frame.iloc[0]
frame - series  # è¡Œä¸Šå¹¿æ’­

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [111]:
# æƒ³åœ¨åˆ—ä¸Šå¹¿æ’­ï¼Œå¿…é¡»ç”¨ç®—æœ¯è¿ç®—æ³•  -- add, sub,div,mul
frame.sub(series, axis = 0)

         b   d   e
Ohio   NaN NaN NaN
Oregon NaN NaN NaN
Texas  NaN NaN NaN
Utah   NaN NaN NaN
b      NaN NaN NaN
d      NaN NaN NaN
e      NaN NaN NaN

In [113]:
# apply
def f(x):
    return Series([x.min(), x.max()], index = ['min','max'])
frame.apply(f)

     b   d   e
min  0   1   2
max  9  10  11

In [114]:
# applymap -- å…‹éš†Seriesçš„map
format = lambda x: '%.2f' % x
frame.applymap(format)

           b      d      e
Utah    0.00   1.00   2.00
Ohio    3.00   4.00   5.00
Texas   6.00   7.00   8.00
Oregon  9.00  10.00  11.00

In [115]:
frame['e'].map(format)

Utah       2.00
Ohio       5.00
Texas      8.00
Oregon    11.00
Name: e, dtype: object

In [117]:
#5 æ’åºä¸æ’å
# æŒ‰ç´¢å¼•æ’åº
frame.sort_index(axis = 1,ascending = False)  # é»˜è®¤axis = 0, ascending = True

         e   d  b
Utah     2   1  0
Ohio     5   4  3
Texas    8   7  6
Oregon  11  10  9

In [124]:
# æŒ‰å€¼æ’åº
frame.sort_values(by = 'b')# by = åˆ—å

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [126]:
obj.sort_values

<bound method Series.sort_values of d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64>

In [127]:
#  æ’å
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()  # method = average(é»˜è®¤)ï¼Œmax/min.first 
            # å¯¹äºframe æœ‰axis

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [128]:
obj.rank(ascending = False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [129]:
# é‡å¤ç´¢å¼•
obj.index.is_unique

True

In [130]:
#6 æ±‡æ€»å’Œè®¡ç®—æè¿°ç»Ÿè®¡
# count    describe    min, max,   argmin, argmax--ç´¢å¼•ä½ç½®   idxmin idxmax--ç´¢å¼•å€¼    quantile   sum   mean
# median   mad--å¹³å‡ç»å¯¹ç¦»å·®   var  std   skew   kurt    cumsum   cummin,cummax--ç´¯è®¡æœ€å¤§å€¼ï¼Œç´¯è®¡æœ€å°å€¼  comprod--ç´¯è®¡ç§¯  
# diff      pct_change-- è®¡ç®—ç™¾åˆ†æ•°å˜åŒ–
# corr()   cov()
# seriesä¸series  A.corrwith(B)
# frame ä¸ series  A.corrwith(B)   frameæŒ‰åˆ—    A.corrwith(B, axis = 1)  frameæŒ‰è¡Œ

In [132]:
# å”¯ä¸€å€¼ï¼Œå€¼è®¡æ•°ä¸æˆå‘˜èµ„æ ¼
obj.unique()

array([ 7, -5,  4,  2,  0], dtype=int64)

In [133]:
obj.value_counts()

 7    2
 4    2
-5    1
 2    1
 0    1
dtype: int64

In [134]:
obj.value_counts(sort = False)

 0    1
 2    1
-5    1
 4    2
 7    2
dtype: int64

In [136]:
obj.isin([2])  # 2æ˜¯å¦åœ¨objä¸­

0    False
1    False
2    False
3    False
4     True
5    False
6    False
dtype: bool

In [2]:
#7 å¤„ç†ç¼ºå¤±æ•°æ®
# pandasä¸­ä½¿ç”¨æµ®ç‚¹å€¼NaNè¡¨ç¤ºæµ®ç‚¹å’Œéæµ®ç‚¹æ•°ç»„ä¸­çš„ç¼ºå¤±æ•°æ®
# Pythonå†…ç½®çš„Noneå€¼ä¹Ÿä¼šè¢«å½“ä½œNAå¤„ç†
# dropna  fillna  isnull  notnull
from numpy import nan as NA
data = Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

data[data.notnull()]

In [41]:
data = DataFrame([[1, 6.5, 3],[1,NA,NA],
                 [NA,NA,NA],[NA,6.5,3]])
cleand = data.dropna()
cleand

     0    1    2
0  1.0  6.5  3.0

In [16]:
data.dropna(how = 'all')  # åªä¸¢å¼ƒå…¨ä¸ºNAçš„é‚£äº›è¡Œ

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [13]:
data[4] = NA

In [18]:
data.dropna(axis = 1, how = 'all')  # åˆ æ‰äº†ç¬¬å››åˆ—ï¼Œå› ä¸ºå…¶å…¨éƒ¨å…ƒç´ éƒ½æ˜¯NA

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
# å¡«å……ç¼ºå¤±æ•°æ®
data.fillna(0)

     0    1    2    4
0  1.0  6.5  3.0  0.0
1  1.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
3  0.0  6.5  3.0  0.0

In [26]:
data.fillna({1:0.5,4:5})  # å¯¹ä¸åŒåˆ—å¡«å……ä¸åŒå€¼--ç”¨å­—å…¸çš„æ–¹æ³•

     0    1    2    4
0  1.0  6.5  3.0  5.0
1  1.0  0.5  NaN  5.0
2  NaN  0.5  NaN  5.0
3  NaN  6.5  3.0  5.0

In [27]:
# å°±åœ°ä¿®æ”¹ä¸ç”Ÿæˆå‰¯æœ¬
_ = data.fillna(0, inplace = True)
data

     0    1    2    4
0  1.0  6.5  3.0  0.0
1  1.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
3  0.0  6.5  3.0  0.0

In [43]:
# reindexä¸­fillnaçš„åº”ç”¨
data.fillna(data.mean())

     0    1    2
0  1.0  6.5  3.0
1  1.0  6.5  3.0
2  1.0  6.5  3.0
3  1.0  6.5  3.0

In [48]:
data.dropna(how = 'all').fillna(data.sum(axis = 0))  # å·§å¦™çš„è¿ç”¨ axis = 0æ˜¯åˆ—ï¼Œ1æ˜¯è¡Œ

     0     1    2
0  1.0   6.5  3.0
1  1.0  13.0  6.0
3  2.0   6.5  3.0

In [46]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [49]:
data.sum(axis = 1)

0    10.5
1     1.0
2     NaN
3     9.5
dtype: float64

In [51]:
# å±‚æ¬¡åŒ–ç´¢å¼•
# å¯ä»¥åœ¨ä¸€ä¸ªè½´ä¸Šæ‹¥æœ‰å¤šä¸ªç´¢å¼• -- ç”¨ä½çº¬åº¦å½¢å¼å¤„ç†é«˜çº¬åº¦æ•°æ®
import numpy as np
data = Series(np.random.randn(10),index = [['a','a','a','b','b','b','c','c','d','d'],[1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1    1.176224
   2   -0.402358
   3    0.166712
b  1    0.483971
   2   -0.528979
   3   -0.926673
c  1    0.587399
   2    0.604816
d  2    1.023289
   3    0.895870
dtype: float64

In [52]:
data.index  # MultiIndexç´¢å¼•

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [53]:
data['b']  # æå–å¤–å±‚ç´¢å¼•

1    0.483971
2   -0.528979
3   -0.926673
dtype: float64

In [55]:
data[:,2]  # æå–å†…å±‚ç´¢å¼•

a   -0.402358
b   -0.528979
c    0.604816
d    1.023289
dtype: float64

In [58]:
# å±‚æ¬¡åŒ–ç´¢å¼•åœ¨æ•°æ®é‡å¡‘ä¸åˆ†ç»„æ“ä½œä¸­æ‰®æ¼”ç€é‡è¦è§’è‰²

In [60]:
# unstackæ–¹æ³•ï¼š å°†å±‚æ¬¡åŒ–ç´¢å¼•æ•°æ®è½¬åŒ–ä¸ºDataFrame
data.unstack()

          1         2         3
a  1.176224 -0.402358  0.166712
b  0.483971 -0.528979 -0.926673
c  0.587399  0.604816       NaN
d       NaN  1.023289  0.895870

In [61]:
data.unstack().stack()

a  1    1.176224
   2   -0.402358
   3    0.166712
b  1    0.483971
   2   -0.528979
   3   -0.926673
c  1    0.587399
   2    0.604816
d  2    1.023289
   3    0.895870
dtype: float64

In [62]:
# å¯¹äºDataFrameæ¯æ¡è½´éƒ½å¯ä»¥æœ‰åˆ†å±‚ç´¢å¼•å‘¢
frame = DataFrame(np.arange(12).reshape((4, 3)),index = [['a','a','b','b'],[1,2,2,1]],
                 columns = [['Ohio','Ohio','Colorado'],
                           ['Green','Red','Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 2     6   7        8
  1     9  10       11

In [63]:
# è¿˜å¯ä»¥ç»™äººèµ‹äºˆç´¢å¼•åå­—å‘¢
frame.index.names = ['key1','key2']
frame.columns.names = ['state','color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    2        6   7        8
     1        9  10       11

In [64]:
frame['Ohio']  # è½»æ¾é€‰å–åˆ†ç»„

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    2         6    7
     1         9   10

In [65]:
# é‡æ’åˆ†çº§é¡ºåº
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
     b        6   7        8
1    b        9  10       11

In [67]:
frame.sort_index(level = 1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        9  10       11
a    2        3   4        5
b    2        6   7        8

In [68]:
frame.swaplevel(0, 1).sort_index(level = 0)  # ä¸€èˆ¬éƒ½æ˜¯å¯¹å¤–å±‚ç´¢å¼•è¿›è¡Œæ’åºï¼ˆä»å¤–åˆ°å†…æ’åºï¼‰

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        9  10       11
2    a        3   4        5
     b        6   7        8

In [71]:
frame.T.swaplevel('state','color').T  # ...

color     Green  Red    Green
state      Ohio Ohio Colorado
key1 key2
a    1        0    1        2
     2        3    4        5
b    2        6    7        8
     1        9   10       11

In [73]:
frame.swaplevel('state','color',axis = 1)  # å·§å¦™

color     Green  Red    Green
state      Ohio Ohio Colorado
key1 key2
a    1        0    1        2
     2        3    4        5
b    2        6    7        8
     1        9   10       11

In [74]:
# æ ¹æ®çº§åˆ«æ±‡æ€»ç»Ÿè®¡
frame.sum(level = 'key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         9  11       13
2         9  11       13

In [75]:
frame.sum(level = 'color', axis = 1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    2        14    7
     1        20   10

In [76]:
# å°†DataFrameé‡Œé¢çš„åˆ—è½¬åŒ–ä¸ºç´¢å¼•
frame2 = DataFrame({'a':range(7),'b':range(7,0,-1),
                   'c':['one','one','one','two','two','two','two'],
                   'd':[0,1,2,0,1,2,3]})
frame2

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [77]:
frame2.set_index(['c','d'])  # åˆ—ä¸ºç´¢å¼•çš„åˆ—ä»DataFrameä¸­å‰”é™¤

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [82]:
frame2.set_index(['c','d'], drop = False)  # ä¿ç•™å……åšç´¢å¼•çš„åˆ—

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3